# Import required Libraries

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt 
import matplotlib

# Check the version

In [2]:
print("Pandas Version : {}".format(pd.__version__))
print("Numpy  Version : {}".format(np.__version__))
print("Seaborn Version : {}".format(sns.__version__))
print("Matplotlib Version : {}".format(matplotlib.__version__))

Pandas Version : 1.3.4
Numpy  Version : 1.20.3
Seaborn Version : 0.11.2
Matplotlib Version : 3.4.3

# Import the Loan data csv to DataFrame

In [3]:
loan_df = pd.read_csv('loan.csv')

/Users/monu/opt/anaconda3/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3444: DtypeWarning: Columns (47) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

## Check the top 5 Rows

In [4]:
loan_df.head()

,id,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,grade,sub_grade,...,num_tl_90g_dpd_24m,num_tl_op_past_12m,pct_tl_nvr_dlq,percent_bc_gt_75,pub_rec_bankruptcies,tax_liens,tot_hi_cred_lim,total_bal_ex_mort,total_bc_limit,total_il_high_credit_limit
0,1077501,1296599,5000,5000,4975.0,36 months,10.65%,162.87,B,B2,...,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN,NaN
1,1077430,1314167,2500,2500,2500.0,60 months,15.27%,59.83,C,C4,...,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN,NaN
2,1077175,1313524,2400,2400,2400.0,36 months,15.96%,84.33,C,C5,...,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN,NaN
3,1076863,1277178,10000,10000,10000.0,36 months,13.49%,339.31,C,C1,...,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN,NaN
4,1075358,1311748,3000,3000,3000.0,60 months,12.69%,67.79,B,B5,...,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN,NaN

## Check the Shape of the DataFrame

In [5]:
loan_df.shape

(39717, 111)

## Import the Data Dcitonary Excel

In [6]:
data_dict = pd.read_excel('Data_Dictionary.xlsx')

## Print the df

In [7]:
data_dict

               LoanStatNew                                        Description
0           acc_now_delinq  The number of accounts on which the borrower i...
1     acc_open_past_24mths         Number of trades opened in past 24 months.
2               addr_state  The state provided by the borrower in the loan...
3                 all_util              Balance to credit limit on all trades
4               annual_inc  The self-reported annual income provided by th...
..                     ...                                                ...
112    verification_status  Indicates if income was verified by LC, not ve...
113  verified_status_joint  Indicates if the co-borrowers' joint income wa...
114               zip_code  The first 3 numbers of the zip code provided b...
115                    NaN                                                NaN
116                    NaN  * Employer Title replaces Employer Name for al...

[117 rows x 2 columns]

## check shape

In [8]:
data_dict.shape

(117, 2)

## Drop the last 3 columns as it is the legend for the emp_title

In [9]:
data_dict.dropna(inplace=True)

In [10]:
print("Number of column after dropping the NaN are : {}".format(data_dict.shape))

Number of column after dropping the NaN are : (115, 2)

In [11]:
data_dict.tail()

               LoanStatNew                                        Description
110     total_rev_hi_lim             Total revolving high credit/credit limit
111                    url             URL for the LC page with listing data.
112    verification_status  Indicates if income was verified by LC, not ve...
113  verified_status_joint  Indicates if the co-borrowers' joint income wa...
114               zip_code  The first 3 numbers of the zip code provided b...

## Change the Index to the "LoanStatnew"

In [12]:
data_dict.set_index('LoanStatNew',drop=True,inplace=True)

In [13]:
data_dict

                                                             Description
LoanStatNew
acc_now_delinq         The number of accounts on which the borrower i...
acc_open_past_24mths          Number of trades opened in past 24 months.
addr_state             The state provided by the borrower in the loan...
all_util                           Balance to credit limit on all trades
annual_inc             The self-reported annual income provided by th...
...                                                                  ...
total_rev_hi_lim                Total revolving high credit/credit limit
url                               URL for the LC page with listing data.
verification_status    Indicates if income was verified by LC, not ve...
verified_status_joint  Indicates if the co-borrowers' joint income wa...
zip_code               The first 3 numbers of the zip code provided b...

[115 rows x 1 columns]

## View the discription of each columneasily using the iloc

In [14]:
data_dict.loc['emp_title'][0]

'The job title supplied by the Borrower when applying for the loan.*'

## cleaned the Legends and the Nan Column

In [15]:
data_dict['Description'] = data_dict['Description'].apply(lambda x: x.replace('*',''))

In [16]:
data_dict.loc['emp_title'][0]

'The job title supplied by the Borrower when applying for the loan.'

## Check the Column names

In [17]:
print( "Columns are : \n\n{}".format(','.join(loan_df.columns.to_list() ) ))

Columns are :

id,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,grade,sub_grade,emp_title,emp_length,home_ownership,annual_inc,verification_status,issue_d,loan_status,pymnt_plan,url,desc,purpose,title,zip_code,addr_state,dti,delinq_2yrs,earliest_cr_line,inq_last_6mths,mths_since_last_delinq,mths_since_last_record,open_acc,pub_rec,revol_bal,revol_util,total_acc,initial_list_status,out_prncp,out_prncp_inv,total_pymnt,total_pymnt_inv,total_rec_prncp,total_rec_int,total_rec_late_fee,recoveries,collection_recovery_fee,last_pymnt_d,last_pymnt_amnt,next_pymnt_d,last_credit_pull_d,collections_12_mths_ex_med,mths_since_last_major_derog,policy_code,application_type,annual_inc_joint,dti_joint,verification_status_joint,acc_now_delinq,tot_coll_amt,tot_cur_bal,open_acc_6m,open_il_6m,open_il_12m,open_il_24m,mths_since_rcnt_il,total_bal_il,il_util,open_rv_12m,open_rv_24m,max_bal_bc,all_util,total_rev_hi_lim,inq_fi,total_cu_tl,inq_last_12m,acc_open_past_24mths,avg_cur_bal,bc_open_to_buy,bc_util,chargeoff_within_12_mths,delinq_amnt,mo_sin_old_il_acct,mo_sin_old_rev_tl_op,mo_sin_rcnt_rev_tl_op,mo_sin_rcnt_tl,mort_acc,mths_since_recent_bc,mths_since_recent_bc_dlq,mths_since_recent_inq,mths_since_recent_revol_delinq,num_accts_ever_120_pd,num_actv_bc_tl,num_actv_rev_tl,num_bc_sats,num_bc_tl,num_il_tl,num_op_rev_tl,num_rev_accts,num_rev_tl_bal_gt_0,num_sats,num_tl_120dpd_2m,num_tl_30dpd,num_tl_90g_dpd_24m,num_tl_op_past_12m,pct_tl_nvr_dlq,percent_bc_gt_75,pub_rec_bankruptcies,tax_liens,tot_hi_cred_lim,total_bal_ex_mort,total_bc_limit,total_il_high_credit_limit

## Check the dat type ofthe Dataframe

In [18]:
loan_df.dtypes

id                              int64
member_id                       int64
loan_amnt                       int64
funded_amnt                     int64
funded_amnt_inv               float64
                               ...
tax_liens                     float64
tot_hi_cred_lim               float64
total_bal_ex_mort             float64
total_bc_limit                float64
total_il_high_credit_limit    float64
Length: 111, dtype: object

## Check if it has null values

In [19]:
len(loan_df.columns[loan_df.isnull().sum() > 0].tolist())

68

In [20]:
len(loan_df.columns[loan_df.isnull().any()].tolist())

68

In [21]:
loan_df.columns[loan_df.isnull().sum() > 0].tolist()

['emp_title',
 'emp_length',
 'desc',
 'title',
 'mths_since_last_delinq',
 'mths_since_last_record',
 'revol_util',
 'last_pymnt_d',
 'next_pymnt_d',
 'last_credit_pull_d',
 'collections_12_mths_ex_med',
 'mths_since_last_major_derog',
 'annual_inc_joint',
 'dti_joint',
 'verification_status_joint',
 'tot_coll_amt',
 'tot_cur_bal',
 'open_acc_6m',
 'open_il_6m',
 'open_il_12m',
 'open_il_24m',
 'mths_since_rcnt_il',
 'total_bal_il',
 'il_util',
 'open_rv_12m',
 'open_rv_24m',
 'max_bal_bc',
 'all_util',
 'total_rev_hi_lim',
 'inq_fi',
 'total_cu_tl',
 'inq_last_12m',
 'acc_open_past_24mths',
 'avg_cur_bal',
 'bc_open_to_buy',
 'bc_util',
 'chargeoff_within_12_mths',
 'mo_sin_old_il_acct',
 'mo_sin_old_rev_tl_op',
 'mo_sin_rcnt_rev_tl_op',
 'mo_sin_rcnt_tl',
 'mort_acc',
 'mths_since_recent_bc',
 'mths_since_recent_bc_dlq',
 'mths_since_recent_inq',
 'mths_since_recent_revol_delinq',
 'num_accts_ever_120_pd',
 'num_actv_bc_tl',
 'num_actv_rev_tl',
 'num_bc_sats',
 'num_bc_tl',
 'num_il_tl',
 'num_op_rev_tl',
 'num_rev_accts',
 'num_rev_tl_bal_gt_0',
 'num_sats',
 'num_tl_120dpd_2m',
 'num_tl_30dpd',
 'num_tl_90g_dpd_24m',
 'num_tl_op_past_12m',
 'pct_tl_nvr_dlq',
 'percent_bc_gt_75',
 'pub_rec_bankruptcies',
 'tax_liens',
 'tot_hi_cred_lim',
 'total_bal_ex_mort',
 'total_bc_limit',
 'total_il_high_credit_limit']

## Check on the row wise if we have null values

In [22]:
loan_df.isnull().sum(axis=1).shape

(39717,)

In [23]:
loan_df.shape
#  Ideally  means that all rows has a NAN

(39717, 111)

In [24]:
print("Total Rows in the columns :{}".format(len(loan_df)))
# check if any of the columns has the same length of the dataframe so that we can drop it 
loan_df.columns[loan_df.apply(lambda x: x.isnull().sum() == len(loan_df))]

Total Rows in the columns :39717

Index(['mths_since_last_major_derog', 'annual_inc_joint', 'dti_joint',
       'verification_status_joint', 'tot_coll_amt', 'tot_cur_bal',
       'open_acc_6m', 'open_il_6m', 'open_il_12m', 'open_il_24m',
       'mths_since_rcnt_il', 'total_bal_il', 'il_util', 'open_rv_12m',
       'open_rv_24m', 'max_bal_bc', 'all_util', 'total_rev_hi_lim', 'inq_fi',
       'total_cu_tl', 'inq_last_12m', 'acc_open_past_24mths', 'avg_cur_bal',
       'bc_open_to_buy', 'bc_util', 'mo_sin_old_il_acct',
       'mo_sin_old_rev_tl_op', 'mo_sin_rcnt_rev_tl_op', 'mo_sin_rcnt_tl',
       'mort_acc', 'mths_since_recent_bc', 'mths_since_recent_bc_dlq',
       'mths_since_recent_inq', 'mths_since_recent_revol_delinq',
       'num_accts_ever_120_pd', 'num_actv_bc_tl', 'num_actv_rev_tl',
       'num_bc_sats', 'num_bc_tl', 'num_il_tl', 'num_op_rev_tl',
       'num_rev_accts', 'num_rev_tl_bal_gt_0', 'num_sats', 'num_tl_120dpd_2m',
       'num_tl_30dpd', 'num_tl_90g_dpd_24m', 'num_tl_op_past_12m',
       'pct_tl_nvr_dlq', 'percent_bc_gt_75', 'tot_hi_cred_lim',
       'total_bal_ex_mort', 'total_bc_limit', 'total_il_high_credit_limit'],
      dtype='object')

In [25]:
#Assign the Coloumn just has the NaN value to a list 
drop_columns_nan = loan_df.columns[loan_df.apply(lambda x: x.isnull().sum() == len(loan_df))]

In [26]:
len(drop_columns_nan)
#so 54 columns can be dropped as it is useless data

54

In [27]:
loan_df.drop(columns=drop_columns_nan).shape

(39717, 57)

In [28]:
loan_df.shape

(39717, 111)

In [29]:
loan_df.drop(columns=drop_columns_nan,inplace=True)

In [30]:
loan_df.shape

(39717, 57)

In [31]:
loan_df

,id,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,grade,sub_grade,...,next_pymnt_d,last_credit_pull_d,collections_12_mths_ex_med,policy_code,application_type,acc_now_delinq,chargeoff_within_12_mths,delinq_amnt,pub_rec_bankruptcies,tax_liens
0,1077501,1296599,5000,5000,4975.0,36 months,10.65%,162.87,B,B2,...,NaN,May-16,0.0,1,INDIVIDUAL,0,0.0,0,0.0,0.0
1,1077430,1314167,2500,2500,2500.0,60 months,15.27%,59.83,C,C4,...,NaN,Sep-13,0.0,1,INDIVIDUAL,0,0.0,0,0.0,0.0
2,1077175,1313524,2400,2400,2400.0,36 months,15.96%,84.33,C,C5,...,NaN,May-16,0.0,1,INDIVIDUAL,0,0.0,0,0.0,0.0
3,1076863,1277178,10000,10000,10000.0,36 months,13.49%,339.31,C,C1,...,NaN,Apr-16,0.0,1,INDIVIDUAL,0,0.0,0,0.0,0.0
4,1075358,1311748,3000,3000,3000.0,60 months,12.69%,67.79,B,B5,...,Jun-16,May-16,0.0,1,INDIVIDUAL,0,0.0,0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
39712,92187,92174,2500,2500,1075.0,36 months,8.07%,78.42,A,A4,...,NaN,Jun-10,NaN,1,INDIVIDUAL,0,NaN,0,NaN,NaN
39713,90665,90607,8500,8500,875.0,36 months,10.28%,275.38,C,C1,...,NaN,Jul-10,NaN,1,INDIVIDUAL,0,NaN,0,NaN,NaN
39714,90395,90390,5000,5000,1325.0,36 months,8.07%,156.84,A,A4,...,NaN,Jun-07,NaN,1,INDIVIDUAL,0,NaN,0,NaN,NaN
39715,90376,89243,5000,5000,650.0,36 months,7.43%,155.38,A,A2,...,NaN,Jun-07,NaN,1,INDIVIDUAL,0,NaN,0,NaN,NaN
39716,87023,86999,7500,7500,800.0,36 months,13.75%,255.43,E,E2,...,NaN,Jun-10,NaN,1,INDIVIDUAL,0,NaN,0,NaN,NaN

In [32]:
# check again for Nan Value 
some_nan_value_columns = loan_df.columns[loan_df.isnull().sum() > 0].tolist()

In [33]:
for column in some_nan_value_columns:
    print("Inspecting Column {}".format(column))
    print("XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX")
    print(loan_df.groupby(column, dropna=False, as_index=False).size())

Inspecting Column emp_title
XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
                               emp_title  size
0                           old palm inc     1
1                 Brocade Communications     1
2                            CenturyLink     1
3        Department of Homeland Security     1
4       Down To Earth Distributors, Inc.     1
...                                  ...   ...
28816              zeno office solutions     1
28817               zion lutheran school     1
28818                  zoll medical corp     1
28819                 zozaya officiating     1
28820                                NaN  2459

[28821 rows x 2 columns]
Inspecting Column emp_length
XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
   emp_length  size
0      1 year  3240
1   10+ years  8879
2     2 years  4388
3     3 years  4095
4     4 years  3436
5     5 years  3282
6     6 years  2229
7     7 years  1773
8     8 years  1479
9     9 years  1258
10   < 1 year  4583
11        NaN  1075
Inspecting Column desc
XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
                                                    desc   size
0      \t Member# 809768, loan description. (trying t...      1
1                                                           210
2                Looking to expand seafood buisness. ...      1
3           I would like to increase my cash availabi...      1
4           With this loan, i plan on paying off two ...      1
...                                                  ...    ...
26523  www.cougarenergydrink.com   $40B Global Market...      1
26524  www.music-housecalls.com--The Amadeus Home Mus...      1
26525  ~ STARTUPSNAX SMALL BUSINESS LOAN REQUEST ~  A...      1
26526  ~20K total in medical expenses discovered on e...      1
26527                                                NaN  12940

[26528 rows x 2 columns]
Inspecting Column title
XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
                           title  size
0           \tdebt_consolidation     2
1              HITEK  EQUIPMENT      1
2            APRILIA TUONO 1000R     1
3                           Auto     1
4                      Auto Loan     1
...                          ...   ...
19611                 zandercade     1
19612                     zipcar     1
19613                      zxcvb     1
19614  îîMY FIRST CAR îî     1
19615                        NaN    11

[19616 rows x 2 columns]
Inspecting Column mths_since_last_delinq
XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
    mths_since_last_delinq   size
0                      0.0    443
1                      1.0     30
2                      2.0    101
3                      3.0    145
4                      4.0    153
..                     ...    ...
91                   106.0      1
92                   107.0      1
93                   115.0      1
94                   120.0      1
95                     NaN  25682

[96 rows x 2 columns]
Inspecting Column mths_since_last_record
XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
     mths_since_last_record   size
0                       0.0    670
1                       5.0      1
2                       6.0      1
3                       7.0      1
4                      11.0      2
..                      ...    ...
107                   118.0     36
108                   119.0     10
109                   120.0      1
110                   129.0      1
111                     NaN  36931

[112 rows x 2 columns]
Inspecting Column revol_util
XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
     revol_util  size
0            0%   977
1         0.01%     1
2         0.03%     1
3         0.04%     1
4         0.05%     1
...         ...   ...
1085     99.60%    24
1086     99.70%    31
1087     99.80%    23
1088     99.90%    26
1089        NaN    50

[1090 rows x 2 columns]
Inspecting Column last_pymnt_d
XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
    last_pymnt_d  size
0         Apr-08    12
1         Apr-09    43
2         Apr-10   114
3         Apr-11   420
4         Apr-12   734
..           ...   ...
97        Sep-12   761
98        Sep-13   684
99        Sep-14   693
100       Sep-15   202
101          NaN    71

[102 rows x 2 columns]
Inspecting Column next_pymnt_d
XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
  next_pymnt_d   size
0       Jul-16     15
1       Jun-16   1125
2          NaN  38577
Inspecting Column last_credit_pull_d
XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
    last_credit_pull_d  size
0               Apr-09    15
1               Apr-10    60
2               Apr-11   135
3               Apr-12   308
4               Apr-13   425
..                 ...   ...
102             Sep-12   391
103             Sep-13   390
104             Sep-14   546
105             Sep-15   512
106                NaN     2

[107 rows x 2 columns]
Inspecting Column collections_12_mths_ex_med
XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
   collections_12_mths_ex_med   size
0                         0.0  39661
1                         NaN     56
Inspecting Column chargeoff_within_12_mths
XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
   chargeoff_within_12_mths   size
0                       0.0  39661
1                       NaN     56
Inspecting Column pub_rec_bankruptcies
XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
   pub_rec_bankruptcies   size
0                   0.0  37339
1                   1.0   1674
2                   2.0      7
3                   NaN    697
Inspecting Column tax_liens
XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
   tax_liens   size
0        0.0  39678
1        NaN     39

In [34]:
some_nan_value_columns

['emp_title',
 'emp_length',
 'desc',
 'title',
 'mths_since_last_delinq',
 'mths_since_last_record',
 'revol_util',
 'last_pymnt_d',
 'next_pymnt_d',
 'last_credit_pull_d',
 'collections_12_mths_ex_med',
 'chargeoff_within_12_mths',
 'pub_rec_bankruptcies',
 'tax_liens']

In [35]:
for column in some_nan_value_columns:
    print("{} ==> {}".format(column,data_dict.loc['emp_title'][0]))

emp_title ==> The job title supplied by the Borrower when applying for the loan.
emp_length ==> The job title supplied by the Borrower when applying for the loan.
desc ==> The job title supplied by the Borrower when applying for the loan.
title ==> The job title supplied by the Borrower when applying for the loan.
mths_since_last_delinq ==> The job title supplied by the Borrower when applying for the loan.
mths_since_last_record ==> The job title supplied by the Borrower when applying for the loan.
revol_util ==> The job title supplied by the Borrower when applying for the loan.
last_pymnt_d ==> The job title supplied by the Borrower when applying for the loan.
next_pymnt_d ==> The job title supplied by the Borrower when applying for the loan.
last_credit_pull_d ==> The job title supplied by the Borrower when applying for the loan.
collections_12_mths_ex_med ==> The job title supplied by the Borrower when applying for the loan.
chargeoff_within_12_mths ==> The job title supplied by the Borrower when applying for the loan.
pub_rec_bankruptcies ==> The job title supplied by the Borrower when applying for the loan.
tax_liens ==> The job title supplied by the Borrower when applying for the loan.

## Let's explore the emp_title

In [36]:
# Employee Title as you can see many 2459 Rows has Nan Value as per the data dictonary "* Employer Title replaces Employer Name for all loans listed after 9/23/2013" 
loan_df.head()

,id,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,grade,sub_grade,...,next_pymnt_d,last_credit_pull_d,collections_12_mths_ex_med,policy_code,application_type,acc_now_delinq,chargeoff_within_12_mths,delinq_amnt,pub_rec_bankruptcies,tax_liens
0,1077501,1296599,5000,5000,4975.0,36 months,10.65%,162.87,B,B2,...,NaN,May-16,0.0,1,INDIVIDUAL,0,0.0,0,0.0,0.0
1,1077430,1314167,2500,2500,2500.0,60 months,15.27%,59.83,C,C4,...,NaN,Sep-13,0.0,1,INDIVIDUAL,0,0.0,0,0.0,0.0
2,1077175,1313524,2400,2400,2400.0,36 months,15.96%,84.33,C,C5,...,NaN,May-16,0.0,1,INDIVIDUAL,0,0.0,0,0.0,0.0
3,1076863,1277178,10000,10000,10000.0,36 months,13.49%,339.31,C,C1,...,NaN,Apr-16,0.0,1,INDIVIDUAL,0,0.0,0,0.0,0.0
4,1075358,1311748,3000,3000,3000.0,60 months,12.69%,67.79,B,B5,...,Jun-16,May-16,0.0,1,INDIVIDUAL,0,0.0,0,0.0,0.0

In [37]:
loan_df.shape

(39717, 57)

In [38]:
#filt = loan_df['emp_title'].isnull()

In [39]:
#loan_df[~filt].shape

In [40]:
#loan_df = loan_df[~filt]

In [41]:
#loan_df.shape
#print(loan_df.groupby(column, dropna=False, as_index=False).size())

In [42]:
#loan_df['emp_title'].isnull().sum()

##  Let's explore the emp_title emp_length

In [43]:
emp_length_df = loan_df.groupby(['emp_length'],dropna=False,as_index=False).size().set_index('emp_length')

In [44]:
emp_length_df

            size
emp_length
1 year      3240
10+ years   8879
2 years     4388
3 years     4095
4 years     3436
5 years     3282
6 years     2229
7 years     1773
8 years     1479
9 years     1258
< 1 year    4583
NaN         1075

In [45]:
# 56 ORgani
loan_df.loc[loan_df['emp_length'].isnull() ,['emp_title','emp_length'  , 'application_type','last_pymnt_d']]

        emp_title emp_length application_type last_pymnt_d
168           NaN        NaN       INDIVIDUAL       Dec-13
323           NaN        NaN       INDIVIDUAL       Sep-15
394           NaN        NaN       INDIVIDUAL       May-12
422           NaN        NaN       INDIVIDUAL       Jan-12
439           NaN        NaN       INDIVIDUAL       Dec-14
...           ...        ...              ...          ...
32591         NaN        NaN       INDIVIDUAL       Jun-10
32608         NaN        NaN       INDIVIDUAL       Feb-13
32621         NaN        NaN       INDIVIDUAL       Dec-11
32631  Tong Parks        NaN       INDIVIDUAL       Feb-13
32665         NaN        NaN       INDIVIDUAL       Jun-12

[1075 rows x 4 columns]

## let's explore desc

In [46]:
loan_df.groupby('desc',as_index=False,dropna=False).size()

                                                    desc   size
0      \t Member# 809768, loan description. (trying t...      1
1                                                           210
2                Looking to expand seafood buisness. ...      1
3           I would like to increase my cash availabi...      1
4           With this loan, i plan on paying off two ...      1
...                                                  ...    ...
26523  www.cougarenergydrink.com   $40B Global Market...      1
26524  www.music-housecalls.com--The Amadeus Home Mus...      1
26525  ~ STARTUPSNAX SMALL BUSINESS LOAN REQUEST ~  A...      1
26526  ~20K total in medical expenses discovered on e...      1
26527                                                NaN  12940

[26528 rows x 2 columns]

## let's explore title

In [47]:
loan_df['title'].value_counts()

Debt Consolidation                  2184
Debt Consolidation Loan             1729
Personal Loan                        659
Consolidation                        517
debt consolidation                   505
                                    ...
your rate is better than my rate       1
Concession Trailer                     1
gregs                                  1
EZover                                 1
JAL Loan                               1
Name: title, Length: 19615, dtype: int64

In [48]:
loan_df.groupby('title',as_index=False,dropna=False).size()
# very small Nan

                           title  size
0           \tdebt_consolidation     2
1              HITEK  EQUIPMENT      1
2            APRILIA TUONO 1000R     1
3                           Auto     1
4                      Auto Loan     1
...                          ...   ...
19611                 zandercade     1
19612                     zipcar     1
19613                      zxcvb     1
19614  îîMY FIRST CAR îî     1
19615                        NaN    11

[19616 rows x 2 columns]

## let's explore mths_since_last_delinq
Delinquency means that you are behind on payments. Once you are delinquent for a certain period of time (usually nine months for federal loans), your lender will declare the loan to be in default. The entire loan balance will become due at that time.

When you default on a loan, your account is sent to a debt collection agency that tries to recover your outstanding payments. Defaulting on any payment will reduce your credit score, impair your ability to borrow money in the future, will lead to fees, and possibly result in the seizure of your personal property

In [49]:
data_dict.loc['mths_since_last_delinq'][0]

"The number of months since the borrower's last delinquency."

In [50]:
loan_df.groupby('mths_since_last_delinq',as_index=False,dropna=False).size()

    mths_since_last_delinq   size
0                      0.0    443
1                      1.0     30
2                      2.0    101
3                      3.0    145
4                      4.0    153
..                     ...    ...
91                   106.0      1
92                   107.0      1
93                   115.0      1
94                   120.0      1
95                     NaN  25682

[96 rows x 2 columns]

## let's explore mths_since_last_record

In [51]:
data_dict.loc['mths_since_last_record'][0]

'The number of months since the last public record.'

In [52]:
loan_df.groupby('mths_since_last_record',as_index=False,dropna=False).size().set_index('mths_since_last_record')
#34k All are missing mths_since_last_record

                         size
mths_since_last_record
0.0                       670
5.0                         1
6.0                         1
7.0                         1
11.0                        2
...                       ...
118.0                      36
119.0                      10
120.0                       1
129.0                       1
NaN                     36931

[112 rows x 1 columns]

## let's explore revol_util

In [53]:
data_dict.loc['revol_util'][0]

'Revolving line utilization rate, or the amount of credit the borrower is using relative to all available revolving credit.'

In [54]:
loan_df.groupby('revol_util',as_index=False,dropna=False).size().set_index('revol_util')
# data in %

            size
revol_util
0%           977
0.01%          1
0.03%          1
0.04%          1
0.05%          1
...          ...
99.60%        24
99.70%        31
99.80%        23
99.90%        26
NaN           50

[1090 rows x 1 columns]

## let's explore last_pymnt_d

In [55]:
loan_df.groupby('last_pymnt_d',as_index='last_pymnt_d',dropna=False).size().reset_index()
#64 data has no date on the last payment

    last_pymnt_d    0
0         Apr-08   12
1         Apr-09   43
2         Apr-10  114
3         Apr-11  420
4         Apr-12  734
..           ...  ...
97        Sep-12  761
98        Sep-13  684
99        Sep-14  693
100       Sep-15  202
101          NaN   71

[102 rows x 2 columns]

In [56]:
loan_df.loc[loan_df['last_pymnt_d'].isnull(), ['last_pymnt_d' , 'next_pymnt_d']].values

array([[nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan],
       [nan, nan]], dtype=object)

## Let's explore 'next_pymnt_d'

In [57]:
loan_df.groupby('next_pymnt_d',as_index=False,dropna=False).size().set_index('next_pymnt_d')
#36k don;t have next payment

               size
next_pymnt_d
Jul-16           15
Jun-16         1125
NaN           38577

## Let's explore  Columns
 #ast_credit_pull_d,
 #collections_12_mths_ex_med,
 #chargeoff_within_12_mths,
 #pub_rec_bankruptcies,
 #tax_liens

In [58]:
loan_df.groupby('last_credit_pull_d',as_index=False,dropna=False).size().set_index('last_credit_pull_d')

#last_credit_pull_d',
 #'collections_12_mths_ex_med',
 #'chargeoff_within_12_mths',
 #'pub_rec_bankruptcies',
 #'tax_liens']

                    size
last_credit_pull_d
Apr-09                15
Apr-10                60
Apr-11               135
Apr-12               308
Apr-13               425
...                  ...
Sep-12               391
Sep-13               390
Sep-14               546
Sep-15               512
NaN                    2

[107 rows x 1 columns]

In [60]:
loan_df.groupby('collections_12_mths_ex_med',as_index=False,dropna=False).size().set_index('collections_12_mths_ex_med')

                             size
collections_12_mths_ex_med
0.0                         39661
NaN                            56

In [62]:
loan_df.groupby('chargeoff_within_12_mths',as_index=False,dropna=False).size().set_index('chargeoff_within_12_mths')

                           size
chargeoff_within_12_mths
0.0                       39661
NaN                          56

In [63]:
loan_df.groupby('pub_rec_bankruptcies',as_index=False,dropna=False).size().set_index('pub_rec_bankruptcies')

                       size
pub_rec_bankruptcies
0.0                   37339
1.0                    1674
2.0                       7
NaN                     697

In [64]:
loan_df.groupby('tax_liens',as_index=False,dropna=False).size().set_index('tax_liens')

            size
tax_liens
0.0        39678
NaN           39

In [66]:
loan_df.dtypes

id                              int64
member_id                       int64
loan_amnt                       int64
funded_amnt                     int64
funded_amnt_inv               float64
term                           object
int_rate                       object
installment                   float64
grade                          object
sub_grade                      object
emp_title                      object
emp_length                     object
home_ownership                 object
annual_inc                    float64
verification_status            object
issue_d                        object
loan_status                    object
pymnt_plan                     object
url                            object
desc                           object
purpose                        object
title                          object
zip_code                       object
addr_state                     object
dti                           float64
delinq_2yrs                     int64
earliest_cr_line               object
inq_last_6mths                  int64
mths_since_last_delinq        float64
mths_since_last_record        float64
open_acc                        int64
pub_rec                         int64
revol_bal                       int64
revol_util                     object
total_acc                       int64
initial_list_status            object
out_prncp                     float64
out_prncp_inv                 float64
total_pymnt                   float64
total_pymnt_inv               float64
total_rec_prncp               float64
total_rec_int                 float64
total_rec_late_fee            float64
recoveries                    float64
collection_recovery_fee       float64
last_pymnt_d                   object
last_pymnt_amnt               float64
next_pymnt_d                   object
last_credit_pull_d             object
collections_12_mths_ex_med    float64
policy_code                     int64
application_type               object
acc_now_delinq                  int64
chargeoff_within_12_mths      float64
delinq_amnt                     int64
pub_rec_bankruptcies          float64
tax_liens                     float64
dtype: object

In [74]:
#loan_df.loc[loan_df.columns]

for column in loan_df.columns.tolist():
    print("{} ===> {}".format(column,data_dict.loc[column][0]))

id ===> A unique LC assigned ID for the loan listing.
member_id ===> A unique LC assigned Id for the borrower member.
loan_amnt ===> The listed amount of the loan applied for by the borrower. If at some point in time, the credit department reduces the loan amount, then it will be reflected in this value.
funded_amnt ===> The total amount committed to that loan at that point in time.
funded_amnt_inv ===> The total amount committed by investors for that loan at that point in time.
term ===> The number of payments on the loan. Values are in months and can be either 36 or 60.
int_rate ===> Interest Rate on the loan
installment ===> The monthly payment owed by the borrower if the loan originates.
grade ===> LC assigned loan grade
sub_grade ===> LC assigned loan subgrade
emp_title ===> The job title supplied by the Borrower when applying for the loan.
emp_length ===> Employment length in years. Possible values are between 0 and 10 where 0 means less than one year and 10 means ten or more years.
home_ownership ===> The home ownership status provided by the borrower during registration. Our values are: RENT, OWN, MORTGAGE, OTHER.
annual_inc ===> The self-reported annual income provided by the borrower during registration.
verification_status ===> Indicates if income was verified by LC, not verified, or if the income source was verified
issue_d ===> The month which the loan was funded
loan_status ===> Current status of the loan
pymnt_plan ===> Indicates if a payment plan has been put in place for the loan
url ===> URL for the LC page with listing data.
desc ===> Loan description provided by the borrower
purpose ===> A category provided by the borrower for the loan request.
title ===> The loan title provided by the borrower
zip_code ===> The first 3 numbers of the zip code provided by the borrower in the loan application.
addr_state ===> The state provided by the borrower in the loan application
dti ===> A ratio calculated using the borrower’s total monthly debt payments on the total debt obligations, excluding mortgage and the requested LC loan, divided by the borrower’s self-reported monthly income.
delinq_2yrs ===> The number of 30+ days past-due incidences of delinquency in the borrower's credit file for the past 2 years
earliest_cr_line ===> The month the borrower's earliest reported credit line was opened
inq_last_6mths ===> The number of inquiries in past 6 months (excluding auto and mortgage inquiries)
mths_since_last_delinq ===> The number of months since the borrower's last delinquency.
mths_since_last_record ===> The number of months since the last public record.
open_acc ===> The number of open credit lines in the borrower's credit file.
pub_rec ===> Number of derogatory public records
revol_bal ===> Total credit revolving balance
revol_util ===> Revolving line utilization rate, or the amount of credit the borrower is using relative to all available revolving credit.
total_acc ===> The total number of credit lines currently in the borrower's credit file
initial_list_status ===> The initial listing status of the loan. Possible values are – W, F
out_prncp ===> Remaining outstanding principal for total amount funded
out_prncp_inv ===> Remaining outstanding principal for portion of total amount funded by investors
total_pymnt ===> Payments received to date for total amount funded
total_pymnt_inv ===> Payments received to date for portion of total amount funded by investors
total_rec_prncp ===> Principal received to date
total_rec_int ===> Interest received to date
total_rec_late_fee ===> Late fees received to date
recoveries ===> post charge off gross recovery
collection_recovery_fee ===> post charge off collection fee
last_pymnt_d ===> Last month payment was received
last_pymnt_amnt ===> Last total payment amount received
next_pymnt_d ===> Next scheduled payment date
last_credit_pull_d ===> The most recent month LC pulled credit for this loan
collections_12_mths_ex_med ===> Number of collections in 12 months excluding medical collections
policy_code ===> publicly available policy_code=1
new products not publicly available policy_code=2
application_type ===> Indicates whether the loan is an individual application or a joint application with two co-borrowers
acc_now_delinq ===> The number of accounts on which the borrower is now delinquent.
chargeoff_within_12_mths ===> Number of charge-offs within 12 months
delinq_amnt ===> The past-due amount owed for the accounts on which the borrower is now delinquent.
pub_rec_bankruptcies ===> Number of public record bankruptcies
tax_liens ===> Number of tax liens

In [75]:
loan_df['term'].value_counts()

 36 months    29096
 60 months    10621
Name: term, dtype: int64

In [78]:
loan_df.groupby('term',dropna=False,as_index='term').size()

term
 36 months    29096
 60 months    10621
dtype: int64

In [80]:
29096 + 10621

39717